package Lesson15.homeWork15_1;

public class Aufgabe15_1 {
    public static void main(String[] args) {
        //## Создание Класса (капсулы)
        //- Шаг 1: создание полей:
        //  - определяем перечень типов, названией переменных и принимаем решения о значениях модификаторов
        //        * public
        //        * static
        //  - прит написании кода идем в обратном направлении, сначала пишем:
        //    - модификаторы
        //    - тип переменной
        //    - имя переменной
        //
        //- Шаг 2: определение методов
        //  - стандартые методы - конструктор, геттеры и сеттеры
        //  - дополнительные методы
        //--------------------------------------------------------------------------------------------------------------------
        //Создать класс Rectangle, описывающий прямоугольник cо сторонами a и b.
        //Реализовать в нем методы определения периметра p и площади s.
        //Создать класс RectangleAppl, в котором создать несколько экземпляров
        //класса прямоугольник, вычислить для них периметр и площадь.
    }
}


